#### Terraform Plan 📝

<details><summary>Show Plan</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create[0m

Terraform will perform the following actions:

[1m  # google_artifact_registry_repository.shorted[0m will be created
[0m  [32m+[0m[0m resource "google_artifact_registry_repository" "shorted" {
      [32m+[0m[0m create_time      = (known after apply)
      [32m+[0m[0m description      = "Docker images for Shorted services"
      [32m+[0m[0m effective_labels = {
          [32m+[0m[0m "environment" = "dev"
          [32m+[0m[0m "managed_by"  = "terraform"
        }
      [32m+[0m[0m format           = "DOCKER"
      [32m+[0m[0m id               = (known after apply)
      [32m+[0m[0m labels           = {
          [32m+[0m[0m "environment" = "dev"
          [32m+[0m[0m "managed_by"  = "terraform"
        }
      [32m+[0m[0m location         = "australia-southeast2"
      [32m+[0m[0m mode             = "STANDARD_REPOSITORY"
      [32m+[0m[0m name             = (known after apply)
      [32m+[0m[0m project          = "shorted-dev-aba5688f"
      [32m+[0m[0m repository_id    = "shorted"
      [32m+[0m[0m terraform_labels = {
          [32m+[0m[0m "environment" = "dev"
          [32m+[0m[0m "managed_by"  = "terraform"
        }
      [32m+[0m[0m update_time      = (known after apply)
    }

[1m  # google_project_service.required_apis["artifactregistry.googleapis.com"][0m will be created
[0m  [32m+[0m[0m resource "google_project_service" "required_apis" {
      [32m+[0m[0m disable_on_destroy = false
      [32m+[0m[0m id                 = (known after apply)
      [32m+[0m[0m project            = "shorted-dev-aba5688f"
      [32m+[0m[0m service            = "artifactregistry.googleapis.com"
    }

[1m  # google_project_service.required_apis["cloudscheduler.googleapis.com"][0m will be created
[0m  [32m+[0m[0m resource "google_project_service" "required_apis" {
      [32m+[0m[0m disable_on_destroy = false
      [32m+[0m[0m id                 = (known after apply)
      [32m+[0m[0m project            = "shorted-dev-aba5688f"
      [32m+[0m[0m service            = "cloudscheduler.googleapis.com"
    }

[1m  # google_project_service.required_apis["compute.googleapis.com"][0m will be created
[0m  [32m+[0m[0m resource "google_project_service" "required_apis" {
      [32m+[0m[0m disable_on_destroy = false
      [32m+[0m[0m id                 = (known after apply)
      [32m+[0m[0m project            = "shorted-dev-aba5688f"
      [32m+[0m[0m service            = "compute.googleapis.com"
    }

[1m  # google_project_service.required_apis["iam.googleapis.com"][0m will be created
[0m  [32m+[0m[0m resource "google_project_service" "required_apis" {
      [32m+[0m[0m disable_on_destroy = false
      [32m+[0m[0m id                 = (known after apply)
      [32m+[0m[0m project            = "shorted-dev-aba5688f"
      [32m+[0m[0m service            = "iam.googleapis.com"
    }

[1m  # google_project_service.required_apis["pubsub.googleapis.com"][0m will be created
[0m  [32m+[0m[0m resource "google_project_service" "required_apis" {
      [32m+[0m[0m disable_on_destroy = false
      [32m+[0m[0m id                 = (known after apply)
      [32m+[0m[0m project            = "shorted-dev-aba5688f"
      [32m+[0m[0m service            = "pubsub.googleapis.com"
    }

[1m  # google_project_service.required_apis["run.googleapis.com"][0m will be created
[0m  [32m+[0m[0m resource "google_project_service" "required_apis" {
      [32m+[0m[0m disable_on_destroy = false
      [32m+[0m[0m id                 = (known after apply)
      [32m+[0m[0m project            = "shorted-dev-aba5688f"
      [32m+[0m[0m service            = "run.googleapis.com"
    }

[1m  # google_project_service.required_apis["secretmanager.googleapis.com"][0m will be created
[0m  [32m+[0m[0m resource "google_project_service" "required_apis" {
      [32m+[0m[0m disable_on_destroy = false
      [32m+[0m[0m id                 = (known after apply)
      [32m+[0m[0m project            = "shorted-dev-aba5688f"
      [32m+[0m[0m service            = "secretmanager.googleapis.com"
    }

[1m  # module.cms.google_cloud_run_v2_service.cms[0m will be created
[0m  [32m+[0m[0m resource "google_cloud_run_v2_service" "cms" {
      [32m+[0m[0m conditions              = (known after apply)
      [32m+[0m[0m create_time             = (known after apply)
      [32m+[0m[0m creator                 = (known after apply)
      [32m+[0m[0m delete_time             = (known after apply)
      [32m+[0m[0m effective_annotations   = (known after apply)
      [32m+[0m[0m effective_labels        = {
          [32m+[0m[0m "environment" = "production"
          [32m+[0m[0m "managed_by"  = "terraform"
          [32m+[0m[0m "service"     = "cms"
        }
      [32m+[0m[0m etag                    = (known after apply)
      [32m+[0m[0m expire_time             = (known after apply)
      [32m+[0m[0m generation              = (known after apply)
      [32m+[0m[0m id                      = (known after apply)
      [32m+[0m[0m ingress                 = (known after apply)
      [32m+[0m[0m labels                  = {
          [32m+[0m[0m "environment" = "production"
          [32m+[0m[0m "managed_by"  = "terraform"
          [32m+[0m[0m "service"     = "cms"
        }
      [32m+[0m[0m last_modifier           = (known after apply)
      [32m+[0m[0m latest_created_revision = (known after apply)
      [32m+[0m[0m latest_ready_revision   = (known after apply)
      [32m+[0m[0m launch_stage            = (known after apply)
      [32m+[0m[0m location                = "australia-southeast2"
      [32m+[0m[0m name                    = "cms"
      [32m+[0m[0m observed_generation     = (known after apply)
      [32m+[0m[0m project                 = "shorted-dev-aba5688f"
      [32m+[0m[0m reconciling             = (known after apply)
      [32m+[0m[0m terminal_condition      = (known after apply)
      [32m+[0m[0m terraform_labels        = {
          [32m+[0m[0m "environment" = "production"
          [32m+[0m[0m "managed_by"  = "terraform"
          [32m+[0m[0m "service"     = "cms"
        }
      [32m+[0m[0m traffic_statuses        = (known after apply)
      [32m+[0m[0m uid                     = (known after apply)
      [32m+[0m[0m update_time             = (known after apply)
      [32m+[0m[0m uri                     = (known after apply)

      [32m+[0m[0m template {
          [32m+[0m[0m max_instance_request_concurrency = (known after apply)
          [32m+[0m[0m service_account                  = (known after apply)
          [32m+[0m[0m timeout                          = "300s"

          [32m+[0m[0m containers {
              [32m+[0m[0m image = "australia-southeast2-docker.pkg.dev/shorted-dev-aba5688f/shorted/cms:pr-44"

              [32m+[0m[0m env {
                  [32m+[0m[0m name  = "ENVIRONMENT"
                  [32m+[0m[0m value = "production"
                }
              [32m+[0m[0m env {
                  [32m+[0m[0m name  = "GCP_PROJECT"
                  [32m+[0m[0m value = "shorted-dev-aba5688f"
                }
              [32m+[0m[0m env {
                  [32m+[0m[0m name  = "NODE_ENV"
                  [32m+[0m[0m value = "production"
                }
              [32m+[0m[0m env {
                  [32m+[0m[0m name  = "PAYLOAD_CONFIG_PATH"
                  [32m+[0m[0m value = "dist/payload.config.js"
                }
              [32m+[0m[0m env {
                  [32m+[0m[0m name  = "PAYLOAD_PUBLIC_SERVER_URL"
                  [32m+[0m[0m value = "https://cms-shorted-dev-aba5688f.run.app"
                }

              [32m+[0m[0m liveness_probe {
                  [32m+[0m[0m failure_threshold     = 3
                  [32m+[0m[0m initial_delay_seconds = 30
                  [32m+[0m[0m period_seconds        = 30
                  [32m+[0m[0m timeout_seconds       = 10

                  [32m+[0m[0m http_get {
                      [32m+[0m[0m path = "/api/health"
                      [32m+[0m[0m port = 3000
                    }
                }

              [32m+[0m[0m ports {
                  [32m+[0m[0m container_port = 3000
                  [32m+[0m[0m name           = "http1"
                }

              [32m+[0m[0m resources {
                  [32m+[0m[0m cpu_idle          = false
                  [32m+[0m[0m limits            = {
                      [32m+[0m[0m "cpu"    = "1"
                      [32m+[0m[0m "memory" = "1Gi"
                    }
                  [32m+[0m[0m startup_cpu_boost = true
                }

              [32m+[0m[0m startup_probe {
                  [32m+[0m[0m failure_threshold     = 3
                  [32m+[0m[0m initial_delay_seconds = 10
                  [32m+[0m[0m period_seconds        = 10
                  [32m+[0m[0m timeout_seconds       = 5

                  [32m+[0m[0m http_get {
                      [32m+[0m[0m path = "/api/health"
                      [32m+[0m[0m port = 3000
                    }
                }
            }

          [32m+[0m[0m scaling {
              [32m+[0m[0m max_instance_count = 10
              [32m+[0m[0m min_instance_count = 0
            }
        }

      [32m+[0m[0m traffic {
          [32m+[0m[0m percent = 100
          [32m+[0m[0m type    = "TRAFFIC_TARGET_ALLOCATION_TYPE_LATEST"
        }
    }

[1m  # module.cms.google_cloud_run_v2_service_iam_member.cms_access[0m will be created
[0m  [32m+[0m[0m resource "google_cloud_run_v2_service_iam_member" "cms_access" {
      [32m+[0m[0m etag     = (known after apply)
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m location = "australia-southeast2"
      [32m+[0m[0m member   = "allUsers"
      [32m+[0m[0m name     = "cms"
      [32m+[0m[0m project  = "shorted-dev-aba5688f"
      [32m+[0m[0m role     = "roles/run.invoker"
    }

[1m  # module.cms.google_service_account.cms[0m will be created
[0m  [32m+[0m[0m resource "google_service_account" "cms" {
      [32m+[0m[0m account_id   = "shorted-cms"
      [32m+[0m[0m description  = "Service account for Payload CMS"
      [32m+[0m[0m disabled     = false
      [32m+[0m[0m display_name = "CMS Service"
      [32m+[0m[0m email        = (known after apply)
      [32m+[0m[0m id           = (known after apply)
      [32m+[0m[0m member       = (known after apply)
      [32m+[0m[0m name         = (known after apply)
      [32m+[0m[0m project      = "shorted-dev-aba5688f"
      [32m+[0m[0m unique_id    = (known after apply)
    }

[1m  # module.enrichment_processor.google_cloud_run_v2_job.enrichment_processor[0m will be created
[0m  [32m+[0m[0m resource "google_cloud_run_v2_job" "enrichment_processor" {
      [32m+[0m[0m conditions               = (known after apply)
      [32m+[0m[0m create_time              = (known after apply)
      [32m+[0m[0m creator                  = (known after apply)
      [32m+[0m[0m delete_time              = (known after apply)
      [32m+[0m[0m effective_annotations    = (known after apply)
      [32m+[0m[0m effective_labels         = {
          [32m+[0m[0m "environment" = "production"
          [32m+[0m[0m "managed_by"  = "terraform"
          [32m+[0m[0m "service"     = "enrichment-processor"
        }
      [32m+[0m[0m etag                     = (known after apply)
      [32m+[0m[0m execution_count          = (known after apply)
      [32m+[0m[0m expire_time              = (known after apply)
      [32m+[0m[0m generation               = (known after apply)
      [32m+[0m[0m id                       = (known after apply)
      [32m+[0m[0m labels                   = {
          [32m+[0m[0m "environment" = "production"
          [32m+[0m[0m "managed_by"  = "terraform"
          [32m+[0m[0m "service"     = "enrichment-processor"
        }
      [32m+[0m[0m last_modifier            = (known after apply)
      [32m+[0m[0m latest_created_execution = (known after apply)
      [32m+[0m[0m launch_stage             = (known after apply)
      [32m+[0m[0m location                 = "australia-southeast2"
      [32m+[0m[0m name                     = "enrichment-processor"
      [32m+[0m[0m observed_generation      = (known after apply)
      [32m+[0m[0m project                  = "shorted-dev-aba5688f"
      [32m+[0m[0m reconciling              = (known after apply)
      [32m+[0m[0m terminal_condition       = (known after apply)
      [32m+[0m[0m terraform_labels         = {
          [32m+[0m[0m "environment" = "production"
          [32m+[0m[0m "managed_by"  = "terraform"
          [32m+[0m[0m "service"     = "enrichment-processor"
        }
      [32m+[0m[0m uid                      = (known after apply)
      [32m+[0m[0m update_time              = (known after apply)

      [32m+[0m[0m template {
          [32m+[0m[0m parallelism = (known after apply)
          [32m+[0m[0m task_count  = 1

          [32m+[0m[0m template {
              [32m+[0m[0m execution_environment = (known after apply)
              [32m+[0m[0m max_retries           = 3
              [32m+[0m[0m service_account       = (known after apply)
              [32m+[0m[0m timeout               = "600s"

              [32m+[0m[0m containers {
                  [32m+[0m[0m image = "australia-southeast2-docker.pkg.dev/shorted-dev-aba5688f/shorted/enrichment-processor:latest"

                  [32m+[0m[0m env {
                      [32m+[0m[0m name  = "GCP_PROJECT_ID"
                      [32m+[0m[0m value = "shorted-dev-aba5688f"
                    }
                  [32m+[0m[0m env {
                      [32m+[0m[0m name  = "ENRICHMENT_PUBSUB_TOPIC"
                      [32m+[0m[0m value = "enrichment-jobs"
                    }
                  [32m+[0m[0m env {
                      [32m+[0m[0m name  = "ENRICHMENT_PUBSUB_SUBSCRIPTION"
                      [32m+[0m[0m value = "enrichment-jobs-subscription"
                    }
                  [32m+[0m[0m env {
                      [32m+[0m[0m name  = "APP_STORE_POSTGRES_ADDRESS"
                      [32m+[0m[0m value = "aws-0-ap-southeast-2.pooler.supabase.com:5432"
                    }
                  [32m+[0m[0m env {
                      [32m+[0m[0m name  = "APP_STORE_POSTGRES_DATABASE"
                      [32m+[0m[0m value = "postgres"
                    }
                  [32m+[0m[0m env {
                      [32m+[0m[0m name  = "APP_STORE_POSTGRES_USERNAME"
                      [32m+[0m[0m value = "postgres.xivfykscsdagwsreyqgf"
                    }
                  [32m+[0m[0m env {
                      [32m+[0m[0m name = "APP_STORE_POSTGRES_PASSWORD"

                      [32m+[0m[0m value_source {
                          [32m+[0m[0m secret_key_ref {
                              [32m+[0m[0m secret  = "APP_STORE_POSTGRES_PASSWORD"
                              [32m+[0m[0m version = "latest"
                            }
                        }
                    }
                  [32m+[0m[0m env {
                      [32m+[0m[0m name = "OPENAI_API_KEY"

                      [32m+[0m[0m value_source {
                          [32m+[0m[0m secret_key_ref {
                              [32m+[0m[0m secret  = "OPENAI_API_KEY"
                              [32m+[0m[0m version = "latest"
                            }
                        }
                    }

                  [32m+[0m[0m resources {
                      [32m+[0m[0m limits = {
                          [32m+[0m[0m "cpu"    = "4"
                          [32m+[0m[0m "memory" = "8Gi"
                        }
                    }
                }
            }
        }
    }

[1m  # module.enrichment_processor.google_pubsub_subscription.enrichment_jobs[0m will be created
[0m  [32m+[0m[0m resource "google_pubsub_subscription" "enrichment_jobs" {
      [32m+[0m[0m ack_deadline_seconds       = 600
      [32m+[0m[0m effective_labels           = {
          [32m+[0m[0m "environment" = "production"
          [32m+[0m[0m "managed_by"  = "terraform"
          [32m+[0m[0m "service"     = "enrichment-processor"
        }
      [32m+[0m[0m id                         = (known after apply)
      [32m+[0m[0m labels                     = {
          [32m+[0m[0m "environment" = "production"
          [32m+[0m[0m "managed_by"  = "terraform"
          [32m+[0m[0m "service"     = "enrichment-processor"
        }
      [32m+[0m[0m message_retention_duration = "86400s"
      [32m+[0m[0m name                       = "enrichment-jobs-subscription"
      [32m+[0m[0m project                    = "shorted-dev-aba5688f"
      [32m+[0m[0m terraform_labels           = {
          [32m+[0m[0m "environment" = "production"
          [32m+[0m[0m "managed_by"  = "terraform"
          [32m+[0m[0m "service"     = "enrichment-processor"
        }
      [32m+[0m[0m topic                      = "enrichment-jobs"
    }

[1m  # module.enrichment_processor.google_pubsub_subscription_iam_member.processor_subscriber[0m will be created
[0m  [32m+[0m[0m resource "google_pubsub_subscription_iam_member" "processor_subscriber" {
      [32m+[0m[0m etag         = (known after apply)
      [32m+[0m[0m id           = (known after apply)
      [32m+[0m[0m member       = (known after apply)
      [32m+[0m[0m project      = "shorted-dev-aba5688f"
      [32m+[0m[0m role         = "roles/pubsub.subscriber"
      [32m+[0m[0m subscription = "enrichment-jobs-subscription"
    }

[1m  # module.enrichment_processor.google_pubsub_topic.enrichment_jobs[0m will be created
[0m  [32m+[0m[0m resource "google_pubsub_topic" "enrichment_jobs" {
      [32m+[0m[0m effective_labels = {
          [32m+[0m[0m "environment" = "production"
          [32m+[0m[0m "managed_by"  = "terraform"
          [32m+[0m[0m "service"     = "enrichment-processor"
        }
      [32m+[0m[0m id               = (known after apply)
      [32m+[0m[0m labels           = {
          [32m+[0m[0m "environment" = "production"
          [32m+[0m[0m "managed_by"  = "terraform"
          [32m+[0m[0m "service"     = "enrichment-processor"
        }
      [32m+[0m[0m name             = "enrichment-jobs"
      [32m+[0m[0m project          = "shorted-dev-aba5688f"
      [32m+[0m[0m terraform_labels = {
          [32m+[0m[0m "environment" = "production"
          [32m+[0m[0m "managed_by"  = "terraform"
          [32m+[0m[0m "service"     = "enrichment-processor"
        }
    }

[1m  # module.enrichment_processor.google_secret_manager_secret_iam_member.openai_api_key[0m will be created
[0m  [32m+[0m[0m resource "google_secret_manager_secret_iam_member" "openai_api_key" {
      [32m+[0m[0m etag      = (known after apply)
      [32m+[0m[0m id        = (known after apply)
      [32m+[0m[0m member    = (known after apply)
      [32m+[0m[0m project   = "shorted-dev-aba5688f"
      [32m+[0m[0m role      = "roles/secretmanager.secretAccessor"
      [32m+[0m[0m secret_id = "OPENAI_API_KEY"
    }

[1m  # module.enrichment_processor.google_secret_manager_secret_iam_member.postgres_password[0m will be created
[0m  [32m+[0m[0m resource "google_secret_manager_secret_iam_member" "postgres_password" {
      [32m+[0m[0m etag      = (known after apply)
      [32m+[0m[0m id        = (known after apply)
      [32m+[0m[0m member    = (known after apply)
      [32m+[0m[0m project   = "shorted-dev-aba5688f"
      [32m+[0m[0m role      = "roles/secretmanager.secretAccessor"
      [32m+[0m[0m secret_id = "APP_STORE_POSTGRES_PASSWORD"
    }

[1m  # module.enrichment_processor.google_service_account.enrichment_processor[0m will be created
[0m  [32m+[0m[0m resource "google_service_account" "enrichment_processor" {
      [32m+[0m[0m account_id   = "enrichment-processor"
      [32m+[0m[0m description  = "Service account for processing enrichment jobs"
      [32m+[0m[0m disabled     = false
      [32m+[0m[0m display_name = "Enrichment Processor Job"
      [32m+[0m[0m email        = (known after apply)
      [32m+[0m[0m id           = (known after apply)
      [32m+[0m[0m member       = (known after apply)
      [32m+[0m[0m name         = (known after apply)
      [32m+[0m[0m project      = "shorted-dev-aba5688f"
      [32m+[0m[0m unique_id    = (known after apply)
    }

[1m  # module.market_discovery_sync.google_cloud_run_v2_job.asx_discovery[0m will be created
[0m  [32m+[0m[0m resource "google_cloud_run_v2_job" "asx_discovery" {
      [32m+[0m[0m conditions               = (known after apply)
      [32m+[0m[0m create_time              = (known after apply)
      [32m+[0m[0m creator                  = (known after apply)
      [32m+[0m[0m delete_time              = (known after apply)
      [32m+[0m[0m effective_annotations    = (known after apply)
      [32m+[0m[0m effective_labels         = (known after apply)
      [32m+[0m[0m etag                     = (known after apply)
      [32m+[0m[0m execution_count          = (known after apply)
      [32m+[0m[0m expire_time              = (known after apply)
      [32m+[0m[0m generation               = (known after apply)
      [32m+[0m[0m id                       = (known after apply)
      [32m+[0m[0m last_modifier            = (known after apply)
      [32m+[0m[0m latest_created_execution = (known after apply)
      [32m+[0m[0m launch_stage             = (known after apply)
      [32m+[0m[0m location                 = "australia-southeast2"
      [32m+[0m[0m name                     = "asx-discovery"
      [32m+[0m[0m observed_generation      = (known after apply)
      [32m+[0m[0m project                  = "shorted-dev-aba5688f"
      [32m+[0m[0m reconciling              = (known after apply)
      [32m+[0m[0m terminal_condition       = (known after apply)
      [32m+[0m[0m terraform_labels         = (known after apply)
      [32m+[0m[0m uid                      = (known after apply)
      [32m+[0m[0m update_time              = (known after apply)

      [32m+[0m[0m template {
          [32m+[0m[0m parallelism = (known after apply)
          [32m+[0m[0m task_count  = (known after apply)

          [32m+[0m[0m template {
              [32m+[0m[0m execution_environment = (known after apply)
              [32m+[0m[0m max_retries           = 3
              [32m+[0m[0m service_account       = (known after apply)
              [32m+[0m[0m timeout               = (known after apply)

              [32m+[0m[0m containers {
                  [32m+[0m[0m image = "australia-southeast2-docker.pkg.dev/shorted-dev-aba5688f/shorted/asx-discovery:pr-44"

                  [32m+[0m[0m env {
                      [32m+[0m[0m name  = "GCS_BUCKET_NAME"
                      [32m+[0m[0m value = "shorted-short-selling-data"
                    }

                  [32m+[0m[0m resources {
                      [32m+[0m[0m limits = {
                          [32m+[0m[0m "cpu"    = "1"
                          [32m+[0m[0m "memory" = "2Gi"
                        }
                    }
                }
            }
        }
    }

[1m  # module.market_discovery_sync.google_cloud_run_v2_job_iam_member.asx_discovery_invoker[0m will be created
[0m  [32m+[0m[0m resource "google_cloud_run_v2_job_iam_member" "asx_discovery_invoker" {
      [32m+[0m[0m etag     = (known after apply)
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m location = "australia-southeast2"
      [32m+[0m[0m member   = (known after apply)
      [32m+[0m[0m name     = "asx-discovery"
      [32m+[0m[0m project  = "shorted-dev-aba5688f"
      [32m+[0m[0m role     = "roles/run.invoker"
    }

[1m  # module.market_discovery_sync.google_cloud_run_v2_service.market_data_sync[0m will be created
[0m  [32m+[0m[0m resource "google_cloud_run_v2_service" "market_data_sync" {
      [32m+[0m[0m conditions              = (known after apply)
      [32m+[0m[0m create_time             = (known after apply)
      [32m+[0m[0m creator                 = (known after apply)
      [32m+[0m[0m delete_time             = (known after apply)
      [32m+[0m[0m effective_annotations   = (known after apply)
      [32m+[0m[0m effective_labels        = {
          [32m+[0m[0m "environment" = "dev"
          [32m+[0m[0m "managed_by"  = "terraform"
          [32m+[0m[0m "module"      = "market-discovery-sync"
        }
      [32m+[0m[0m etag                    = (known after apply)
      [32m+[0m[0m expire_time             = (known after apply)
      [32m+[0m[0m generation              = (known after apply)
      [32m+[0m[0m id                      = (known after apply)
      [32m+[0m[0m ingress                 = (known after apply)
      [32m+[0m[0m labels                  = {
          [32m+[0m[0m "environment" = "dev"
          [32m+[0m[0m "managed_by"  = "terraform"
          [32m+[0m[0m "module"      = "market-discovery-sync"
        }
      [32m+[0m[0m last_modifier           = (known after apply)
      [32m+[0m[0m latest_created_revision = (known after apply)
      [32m+[0m[0m latest_ready_revision   = (known after apply)
      [32m+[0m[0m launch_stage            = (known after apply)
      [32m+[0m[0m location                = "australia-southeast2"
      [32m+[0m[0m name                    = "market-data-sync"
      [32m+[0m[0m observed_generation     = (known after apply)
      [32m+[0m[0m project                 = "shorted-dev-aba5688f"
      [32m+[0m[0m reconciling             = (known after apply)
      [32m+[0m[0m terminal_condition      = (known after apply)
      [32m+[0m[0m terraform_labels        = {
          [32m+[0m[0m "environment" = "dev"
          [32m+[0m[0m "managed_by"  = "terraform"
          [32m+[0m[0m "module"      = "market-discovery-sync"
        }
      [32m+[0m[0m traffic_statuses        = (known after apply)
      [32m+[0m[0m uid                     = (known after apply)
      [32m+[0m[0m update_time             = (known after apply)
      [32m+[0m[0m uri                     = (known after apply)

      [32m+[0m[0m template {
          [32m+[0m[0m max_instance_request_concurrency = (known after apply)
          [32m+[0m[0m service_account                  = (known after apply)
          [32m+[0m[0m timeout                          = "600s"

          [32m+[0m[0m containers {
              [32m+[0m[0m image = "australia-southeast2-docker.pkg.dev/shorted-dev-aba5688f/shorted/market-data-sync:pr-44"

              [32m+[0m[0m env {
                  [32m+[0m[0m name  = "ENVIRONMENT"
                  [32m+[0m[0m value = "dev"
                }
              [32m+[0m[0m env {
                  [32m+[0m[0m name  = "GCP_PROJECT"
                  [32m+[0m[0m value = "shorted-dev-aba5688f"
                }
              [32m+[0m[0m env {
                  [32m+[0m[0m name = "DATABASE_URL"

                  [32m+[0m[0m value_source {
                      [32m+[0m[0m secret_key_ref {
                          [32m+[0m[0m secret  = "DATABASE_URL"
                          [32m+[0m[0m version = "latest"
                        }
                    }
                }
              [32m+[0m[0m env {
                  [32m+[0m[0m name  = "GCS_BUCKET_NAME"
                  [32m+[0m[0m value = "shorted-short-selling-data"
                }
              [32m+[0m[0m env {
                  [32m+[0m[0m name  = "PRIORITY_STOCK_COUNT"
                  [32m+[0m[0m value = "100"
                }
              [32m+[0m[0m env {
                  [32m+[0m[0m name = "ALPHA_VANTAGE_API_KEY"

                  [32m+[0m[0m value_source {
                      [32m+[0m[0m secret_key_ref {
                          [32m+[0m[0m secret  = "ALPHA_VANTAGE_API_KEY"
                          [32m+[0m[0m version = "latest"
                        }
                    }
                }

              [32m+[0m[0m liveness_probe {
                  [32m+[0m[0m failure_threshold     = 3
                  [32m+[0m[0m initial_delay_seconds = 30
                  [32m+[0m[0m period_seconds        = 30
                  [32m+[0m[0m timeout_seconds       = 10

                  [32m+[0m[0m http_get {
                      [32m+[0m[0m path = "/healthz"
                      [32m+[0m[0m port = 8080
                    }
                }

              [32m+[0m[0m ports {
                  [32m+[0m[0m container_port = 8080
                  [32m+[0m[0m name           = "http1"
                }

              [32m+[0m[0m resources {
                  [32m+[0m[0m cpu_idle          = false
                  [32m+[0m[0m limits            = {
                      [32m+[0m[0m "cpu"    = "1"
                      [32m+[0m[0m "memory" = "2Gi"
                    }
                  [32m+[0m[0m startup_cpu_boost = true
                }

              [32m+[0m[0m startup_probe {
                  [32m+[0m[0m failure_threshold     = 3
                  [32m+[0m[0m initial_delay_seconds = 10
                  [32m+[0m[0m period_seconds        = 10
                  [32m+[0m[0m timeout_seconds       = 5

                  [32m+[0m[0m http_get {
                      [32m+[0m[0m path = "/healthz"
                      [32m+[0m[0m port = 8080
                    }
                }
            }

          [32m+[0m[0m scaling {
              [32m+[0m[0m max_instance_count = 10
              [32m+[0m[0m min_instance_count = 0
            }
        }

      [32m+[0m[0m traffic {
          [32m+[0m[0m percent = 100
          [32m+[0m[0m type    = "TRAFFIC_TARGET_ALLOCATION_TYPE_LATEST"
        }
    }

[1m  # module.market_discovery_sync.google_cloud_run_v2_service_iam_member.market_data_sync_public[0m will be created
[0m  [32m+[0m[0m resource "google_cloud_run_v2_service_iam_member" "market_data_sync_public" {
      [32m+[0m[0m etag     = (known after apply)
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m location = "australia-southeast2"
      [32m+[0m[0m member   = "allUsers"
      [32m+[0m[0m name     = "market-data-sync"
      [32m+[0m[0m project  = "shorted-dev-aba5688f"
      [32m+[0m[0m role     = "roles/run.invoker"
    }

[1m  # module.market_discovery_sync.google_cloud_run_v2_service_iam_member.market_data_sync_scheduler_invoker[0m will be created
[0m  [32m+[0m[0m resource "google_cloud_run_v2_service_iam_member" "market_data_sync_scheduler_invoker" {
      [32m+[0m[0m etag     = (known after apply)
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m location = "australia-southeast2"
      [32m+[0m[0m member   = (known after apply)
      [32m+[0m[0m name     = "market-data-sync"
      [32m+[0m[0m project  = "shorted-dev-aba5688f"
      [32m+[0m[0m role     = "roles/run.invoker"
    }

[1m  # module.market_discovery_sync.google_cloud_scheduler_job.asx_discovery_weekly[0m will be created
[0m  [32m+[0m[0m resource "google_cloud_scheduler_job" "asx_discovery_weekly" {
      [32m+[0m[0m attempt_deadline = "320s"
      [32m+[0m[0m description      = "Download ASX company directory CSV weekly"
      [32m+[0m[0m id               = (known after apply)
      [32m+[0m[0m name             = "asx-discovery-weekly"
      [32m+[0m[0m paused           = (known after apply)
      [32m+[0m[0m project          = "shorted-dev-aba5688f"
      [32m+[0m[0m region           = "australia-southeast2"
      [32m+[0m[0m schedule         = "0 12 * * 0"
      [32m+[0m[0m state            = (known after apply)
      [32m+[0m[0m time_zone        = "UTC"

      [32m+[0m[0m http_target {
          [32m+[0m[0m http_method = "POST"
          [32m+[0m[0m uri         = "https://australia-southeast2-run.googleapis.com/apis/run.googleapis.com/v1/namespaces/shorted-dev-aba5688f/jobs/asx-discovery:run"

          [32m+[0m[0m oauth_token {
              [32m+[0m[0m service_account_email = (known after apply)
            }
        }
    }

[1m  # module.market_discovery_sync.google_cloud_scheduler_job.market_data_sync_daily[0m will be created
[0m  [32m+[0m[0m resource "google_cloud_scheduler_job" "market_data_sync_daily" {
      [32m+[0m[0m attempt_deadline = "3600s"
      [32m+[0m[0m description      = "Sync stock prices daily via HTTP API"
      [32m+[0m[0m id               = (known after apply)
      [32m+[0m[0m name             = "market-data-sync-daily"
      [32m+[0m[0m paused           = (known after apply)
      [32m+[0m[0m project          = "shorted-dev-aba5688f"
      [32m+[0m[0m region           = "australia-southeast2"
      [32m+[0m[0m schedule         = "0 10 * * 1-5"
      [32m+[0m[0m state            = (known after apply)
      [32m+[0m[0m time_zone        = "UTC"

      [32m+[0m[0m http_target {
          [32m+[0m[0m headers     = {
              [32m+[0m[0m "Content-Type" = "application/json"
            }
          [32m+[0m[0m http_method = "POST"
          [32m+[0m[0m uri         = (known after apply)

          [32m+[0m[0m oauth_token {
              [32m+[0m[0m service_account_email = (known after apply)
            }
        }
    }

[1m  # module.market_discovery_sync.google_secret_manager_secret_iam_member.market_data_sync_av[0m will be created
[0m  [32m+[0m[0m resource "google_secret_manager_secret_iam_member" "market_data_sync_av" {
      [32m+[0m[0m etag      = (known after apply)
      [32m+[0m[0m id        = (known after apply)
      [32m+[0m[0m member    = (known after apply)
      [32m+[0m[0m project   = "shorted-dev-aba5688f"
      [32m+[0m[0m role      = "roles/secretmanager.secretAccessor"
      [32m+[0m[0m secret_id = "ALPHA_VANTAGE_API_KEY"
    }

[1m  # module.market_discovery_sync.google_secret_manager_secret_iam_member.market_data_sync_db[0m will be created
[0m  [32m+[0m[0m resource "google_secret_manager_secret_iam_member" "market_data_sync_db" {
      [32m+[0m[0m etag      = (known after apply)
      [32m+[0m[0m id        = (known after apply)
      [32m+[0m[0m member    = (known after apply)
      [32m+[0m[0m project   = "shorted-dev-aba5688f"
      [32m+[0m[0m role      = "roles/secretmanager.secretAccessor"
      [32m+[0m[0m secret_id = "DATABASE_URL"
    }

[1m  # module.market_discovery_sync.google_service_account.asx_discovery[0m will be created
[0m  [32m+[0m[0m resource "google_service_account" "asx_discovery" {
      [32m+[0m[0m account_id   = "asx-discovery"
      [32m+[0m[0m disabled     = false
      [32m+[0m[0m display_name = "ASX Discovery Job SA"
      [32m+[0m[0m email        = (known after apply)
      [32m+[0m[0m id           = (known after apply)
      [32m+[0m[0m member       = (known after apply)
      [32m+[0m[0m name         = (known after apply)
      [32m+[0m[0m project      = "shorted-dev-aba5688f"
      [32m+[0m[0m unique_id    = (known after apply)
    }

[1m  # module.market_discovery_sync.google_service_account.market_data_sync[0m will be created
[0m  [32m+[0m[0m resource "google_service_account" "market_data_sync" {
      [32m+[0m[0m account_id   = "market-data-sync"
      [32m+[0m[0m disabled     = false
      [32m+[0m[0m display_name = "Market Data Sync Service SA"
      [32m+[0m[0m email        = (known after apply)
      [32m+[0m[0m id           = (known after apply)
      [32m+[0m[0m member       = (known after apply)
      [32m+[0m[0m name         = (known after apply)
      [32m+[0m[0m project      = "shorted-dev-aba5688f"
      [32m+[0m[0m unique_id    = (known after apply)
    }

[1m  # module.market_discovery_sync.google_service_account.scheduler[0m will be created
[0m  [32m+[0m[0m resource "google_service_account" "scheduler" {
      [32m+[0m[0m account_id   = "market-jobs-scheduler"
      [32m+[0m[0m disabled     = false
      [32m+[0m[0m display_name = "Market Jobs Scheduler SA"
      [32m+[0m[0m email        = (known after apply)
      [32m+[0m[0m id           = (known after apply)
      [32m+[0m[0m member       = (known after apply)
      [32m+[0m[0m name         = (known after apply)
      [32m+[0m[0m project      = "shorted-dev-aba5688f"
      [32m+[0m[0m unique_id    = (known after apply)
    }

[1m  # module.market_discovery_sync.google_storage_bucket_iam_member.asx_discovery_gcs[0m will be created
[0m  [32m+[0m[0m resource "google_storage_bucket_iam_member" "asx_discovery_gcs" {
      [32m+[0m[0m bucket = "shorted-short-selling-data"
      [32m+[0m[0m etag   = (known after apply)
      [32m+[0m[0m id     = (known after apply)
      [32m+[0m[0m member = (known after apply)
      [32m+[0m[0m role   = "roles/storage.objectAdmin"
    }

[1m  # module.market_discovery_sync.google_storage_bucket_iam_member.market_data_sync_gcs[0m will be created
[0m  [32m+[0m[0m resource "google_storage_bucket_iam_member" "market_data_sync_gcs" {
      [32m+[0m[0m bucket = "shorted-short-selling-data"
      [32m+[0m[0m etag   = (known after apply)
      [32m+[0m[0m id     = (known after apply)
      [32m+[0m[0m member = (known after apply)
      [32m+[0m[0m role   = "roles/storage.objectAdmin"
    }

[1m  # module.short_data_sync.google_cloud_run_v2_job.short_data_sync[0m will be created
[0m  [32m+[0m[0m resource "google_cloud_run_v2_job" "short_data_sync" {
      [32m+[0m[0m conditions               = (known after apply)
      [32m+[0m[0m create_time              = (known after apply)
      [32m+[0m[0m creator                  = (known after apply)
      [32m+[0m[0m delete_time              = (known after apply)
      [32m+[0m[0m effective_annotations    = (known after apply)
      [32m+[0m[0m effective_labels         = {
          [32m+[0m[0m "environment" = "production"
          [32m+[0m[0m "managed_by"  = "terraform"
          [32m+[0m[0m "service"     = "short-data-sync"
        }
      [32m+[0m[0m etag                     = (known after apply)
      [32m+[0m[0m execution_count          = (known after apply)
      [32m+[0m[0m expire_time              = (known after apply)
      [32m+[0m[0m generation               = (known after apply)
      [32m+[0m[0m id                       = (known after apply)
      [32m+[0m[0m labels                   = {
          [32m+[0m[0m "environment" = "production"
          [32m+[0m[0m "managed_by"  = "terraform"
          [32m+[0m[0m "service"     = "short-data-sync"
        }
      [32m+[0m[0m last_modifier            = (known after apply)
      [32m+[0m[0m latest_created_execution = (known after apply)
      [32m+[0m[0m launch_stage             = (known after apply)
      [32m+[0m[0m location                 = "australia-southeast2"
      [32m+[0m[0m name                     = "shorts-data-sync"
      [32m+[0m[0m observed_generation      = (known after apply)
      [32m+[0m[0m project                  = "shorted-dev-aba5688f"
      [32m+[0m[0m reconciling              = (known after apply)
      [32m+[0m[0m terminal_condition       = (known after apply)
      [32m+[0m[0m terraform_labels         = {
          [32m+[0m[0m "environment" = "production"
          [32m+[0m[0m "managed_by"  = "terraform"
          [32m+[0m[0m "service"     = "short-data-sync"
        }
      [32m+[0m[0m uid                      = (known after apply)
      [32m+[0m[0m update_time              = (known after apply)

      [32m+[0m[0m template {
          [32m+[0m[0m parallelism = (known after apply)
          [32m+[0m[0m task_count  = 1

          [32m+[0m[0m template {
              [32m+[0m[0m execution_environment = (known after apply)
              [32m+[0m[0m max_retries           = 3
              [32m+[0m[0m service_account       = (known after apply)
              [32m+[0m[0m timeout               = "3600s"

              [32m+[0m[0m containers {
                  [32m+[0m[0m image = "australia-southeast2-docker.pkg.dev/shorted-dev-aba5688f/shorted/short-data-sync:pr-44"

                  [32m+[0m[0m env {
                      [32m+[0m[0m name  = "ENVIRONMENT"
                      [32m+[0m[0m value = "production"
                    }
                  [32m+[0m[0m env {
                      [32m+[0m[0m name  = "GCP_PROJECT"
                      [32m+[0m[0m value = "shorted-dev-aba5688f"
                    }
                  [32m+[0m[0m env {
                      [32m+[0m[0m name = "DATABASE_URL"

                      [32m+[0m[0m value_source {
                          [32m+[0m[0m secret_key_ref {
                              [32m+[0m[0m secret  = "DATABASE_URL"
                              [32m+[0m[0m version = "latest"
                            }
                        }
                    }

                  [32m+[0m[0m resources {
                      [32m+[0m[0m limits = {
                          [32m+[0m[0m "cpu"    = "2"
                          [32m+[0m[0m "memory" = "4Gi"
                        }
                    }
                }
            }
        }
    }

[1m  # module.short_data_sync.google_cloud_run_v2_job_iam_member.scheduler_invoker[0m will be created
[0m  [32m+[0m[0m resource "google_cloud_run_v2_job_iam_member" "scheduler_invoker" {
      [32m+[0m[0m etag     = (known after apply)
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m location = "australia-southeast2"
      [32m+[0m[0m member   = (known after apply)
      [32m+[0m[0m name     = "shorts-data-sync"
      [32m+[0m[0m project  = "shorted-dev-aba5688f"
      [32m+[0m[0m role     = "roles/run.invoker"
    }

[1m  # module.short_data_sync.google_cloud_scheduler_job.daily_sync[0m will be created
[0m  [32m+[0m[0m resource "google_cloud_scheduler_job" "daily_sync" {
      [32m+[0m[0m attempt_deadline = "1800s"
      [32m+[0m[0m description      = "Daily sync of ASIC short selling data"
      [32m+[0m[0m id               = (known after apply)
      [32m+[0m[0m name             = "shorts-data-sync-daily"
      [32m+[0m[0m paused           = (known after apply)
      [32m+[0m[0m project          = "shorted-dev-aba5688f"
      [32m+[0m[0m region           = "australia-southeast1"
      [32m+[0m[0m schedule         = "0 10 * * *"
      [32m+[0m[0m state            = (known after apply)
      [32m+[0m[0m time_zone        = "UTC"

      [32m+[0m[0m http_target {
          [32m+[0m[0m http_method = "POST"
          [32m+[0m[0m uri         = "https://australia-southeast2-run.googleapis.com/apis/run.googleapis.com/v1/namespaces/shorted-dev-aba5688f/jobs/shorts-data-sync:run"

          [32m+[0m[0m oauth_token {
              [32m+[0m[0m service_account_email = (known after apply)
            }
        }

      [32m+[0m[0m retry_config {
          [32m+[0m[0m max_backoff_duration = "3600s"
          [32m+[0m[0m max_doublings        = (known after apply)
          [32m+[0m[0m max_retry_duration   = "7200s"
          [32m+[0m[0m min_backoff_duration = "10s"
          [32m+[0m[0m retry_count          = 2
        }
    }

[1m  # module.short_data_sync.google_secret_manager_secret_iam_member.database_url[0m will be created
[0m  [32m+[0m[0m resource "google_secret_manager_secret_iam_member" "database_url" {
      [32m+[0m[0m etag      = (known after apply)
      [32m+[0m[0m id        = (known after apply)
      [32m+[0m[0m member    = (known after apply)
      [32m+[0m[0m project   = "shorted-dev-aba5688f"
      [32m+[0m[0m role      = "roles/secretmanager.secretAccessor"
      [32m+[0m[0m secret_id = "DATABASE_URL"
    }

[1m  # module.short_data_sync.google_service_account.scheduler_invoker[0m will be created
[0m  [32m+[0m[0m resource "google_service_account" "scheduler_invoker" {
      [32m+[0m[0m account_id   = "shorts-data-sync-scheduler"
      [32m+[0m[0m description  = "Service account for Cloud Scheduler to invoke short data sync job"
      [32m+[0m[0m disabled     = false
      [32m+[0m[0m display_name = "Short Data Sync Scheduler"
      [32m+[0m[0m email        = (known after apply)
      [32m+[0m[0m id           = (known after apply)
      [32m+[0m[0m member       = (known after apply)
      [32m+[0m[0m name         = (known after apply)
      [32m+[0m[0m project      = "shorted-dev-aba5688f"
      [32m+[0m[0m unique_id    = (known after apply)
    }

[1m  # module.short_data_sync.google_service_account.short_data_sync[0m will be created
[0m  [32m+[0m[0m resource "google_service_account" "short_data_sync" {
      [32m+[0m[0m account_id   = "shorts-data-sync"
      [32m+[0m[0m description  = "Service account for syncing ASIC short selling data"
      [32m+[0m[0m disabled     = false
      [32m+[0m[0m display_name = "Short Data Sync Job"
      [32m+[0m[0m email        = (known after apply)
      [32m+[0m[0m id           = (known after apply)
      [32m+[0m[0m member       = (known after apply)
      [32m+[0m[0m name         = (known after apply)
      [32m+[0m[0m project      = "shorted-dev-aba5688f"
      [32m+[0m[0m unique_id    = (known after apply)
    }

[1m  # module.short_data_sync.google_storage_bucket.short_selling_data[0m will be created
[0m  [32m+[0m[0m resource "google_storage_bucket" "short_selling_data" {
      [32m+[0m[0m effective_labels            = (known after apply)
      [32m+[0m[0m force_destroy               = false
      [32m+[0m[0m id                          = (known after apply)
      [32m+[0m[0m location                    = "US"
      [32m+[0m[0m name                        = "shorted-short-selling-data"
      [32m+[0m[0m project                     = "shorted-dev-aba5688f"
      [32m+[0m[0m project_number              = (known after apply)
      [32m+[0m[0m public_access_prevention    = (known after apply)
      [32m+[0m[0m rpo                         = (known after apply)
      [32m+[0m[0m self_link                   = (known after apply)
      [32m+[0m[0m storage_class               = "STANDARD"
      [32m+[0m[0m terraform_labels            = (known after apply)
      [32m+[0m[0m uniform_bucket_level_access = true
      [32m+[0m[0m url                         = (known after apply)

      [32m+[0m[0m lifecycle_rule {
          [32m+[0m[0m action {
              [32m+[0m[0m type = "Delete"
            }
          [32m+[0m[0m condition {
              [32m+[0m[0m age                   = 365
              [32m+[0m[0m matches_prefix        = []
              [32m+[0m[0m matches_storage_class = []
              [32m+[0m[0m matches_suffix        = []
              [32m+[0m[0m send_age_if_zero      = true
              [32m+[0m[0m with_state            = (known after apply)
            }
        }

      [32m+[0m[0m versioning {
          [32m+[0m[0m enabled = true
        }
    }

[1m  # module.short_data_sync.google_storage_bucket_iam_member.short_data_sync_bucket[0m will be created
[0m  [32m+[0m[0m resource "google_storage_bucket_iam_member" "short_data_sync_bucket" {
      [32m+[0m[0m bucket = "shorted-short-selling-data"
      [32m+[0m[0m etag   = (known after apply)
      [32m+[0m[0m id     = (known after apply)
      [32m+[0m[0m member = (known after apply)
      [32m+[0m[0m role   = "roles/storage.objectAdmin"
    }

[1m  # module.shorts_api.google_cloud_run_v2_service.shorts_api[0m will be created
[0m  [32m+[0m[0m resource "google_cloud_run_v2_service" "shorts_api" {
      [32m+[0m[0m conditions              = (known after apply)
      [32m+[0m[0m create_time             = (known after apply)
      [32m+[0m[0m creator                 = (known after apply)
      [32m+[0m[0m delete_time             = (known after apply)
      [32m+[0m[0m effective_annotations   = (known after apply)
      [32m+[0m[0m effective_labels        = {
          [32m+[0m[0m "environment" = "production"
          [32m+[0m[0m "managed_by"  = "terraform"
          [32m+[0m[0m "service"     = "shorts-api"
        }
      [32m+[0m[0m etag                    = (known after apply)
      [32m+[0m[0m expire_time             = (known after apply)
      [32m+[0m[0m generation              = (known after apply)
      [32m+[0m[0m id                      = (known after apply)
      [32m+[0m[0m ingress                 = (known after apply)
      [32m+[0m[0m labels                  = {
          [32m+[0m[0m "environment" = "production"
          [32m+[0m[0m "managed_by"  = "terraform"
          [32m+[0m[0m "service"     = "shorts-api"
        }
      [32m+[0m[0m last_modifier           = (known after apply)
      [32m+[0m[0m latest_created_revision = (known after apply)
      [32m+[0m[0m latest_ready_revision   = (known after apply)
      [32m+[0m[0m launch_stage            = (known after apply)
      [32m+[0m[0m location                = "australia-southeast2"
      [32m+[0m[0m name                    = "shorts"
      [32m+[0m[0m observed_generation     = (known after apply)
      [32m+[0m[0m project                 = "shorted-dev-aba5688f"
      [32m+[0m[0m reconciling             = (known after apply)
      [32m+[0m[0m terminal_condition      = (known after apply)
      [32m+[0m[0m terraform_labels        = {
          [32m+[0m[0m "environment" = "production"
          [32m+[0m[0m "managed_by"  = "terraform"
          [32m+[0m[0m "service"     = "shorts-api"
        }
      [32m+[0m[0m traffic_statuses        = (known after apply)
      [32m+[0m[0m uid                     = (known after apply)
      [32m+[0m[0m update_time             = (known after apply)
      [32m+[0m[0m uri                     = (known after apply)

      [32m+[0m[0m template {
          [32m+[0m[0m max_instance_request_concurrency = (known after apply)
          [32m+[0m[0m service_account                  = (known after apply)
          [32m+[0m[0m timeout                          = "300s"

          [32m+[0m[0m containers {
              [32m+[0m[0m image = "australia-southeast2-docker.pkg.dev/shorted-dev-aba5688f/shorted/shorts:pr-44"

              [32m+[0m[0m env {
                  [32m+[0m[0m name  = "ENVIRONMENT"
                  [32m+[0m[0m value = "production"
                }
              [32m+[0m[0m env {
                  [32m+[0m[0m name  = "GCP_PROJECT"
                  [32m+[0m[0m value = "shorted-dev-aba5688f"
                }
              [32m+[0m[0m env {
                  [32m+[0m[0m name  = "APP_STORE_POSTGRES_ADDRESS"
                  [32m+[0m[0m value = "aws-0-ap-southeast-2.pooler.supabase.com:5432"
                }
              [32m+[0m[0m env {
                  [32m+[0m[0m name  = "APP_STORE_POSTGRES_DATABASE"
                  [32m+[0m[0m value = "postgres"
                }
              [32m+[0m[0m env {
                  [32m+[0m[0m name  = "APP_STORE_POSTGRES_USERNAME"
                  [32m+[0m[0m value = "postgres.xivfykscsdagwsreyqgf"
                }
              [32m+[0m[0m env {
                  [32m+[0m[0m name = "APP_STORE_POSTGRES_PASSWORD"

                  [32m+[0m[0m value_source {
                      [32m+[0m[0m secret_key_ref {
                          [32m+[0m[0m secret  = "APP_STORE_POSTGRES_PASSWORD"
                          [32m+[0m[0m version = "latest"
                        }
                    }
                }
              [32m+[0m[0m env {
                  [32m+[0m[0m name = "ALGOLIA_APP_ID"

                  [32m+[0m[0m value_source {
                      [32m+[0m[0m secret_key_ref {
                          [32m+[0m[0m secret  = "ALGOLIA_APP_ID"
                          [32m+[0m[0m version = "latest"
                        }
                    }
                }
              [32m+[0m[0m env {
                  [32m+[0m[0m name = "ALGOLIA_SEARCH_KEY"

                  [32m+[0m[0m value_source {
                      [32m+[0m[0m secret_key_ref {
                          [32m+[0m[0m secret  = "ALGOLIA_SEARCH_KEY"
                          [32m+[0m[0m version = "latest"
                        }
                    }
                }
              [32m+[0m[0m env {
                  [32m+[0m[0m name  = "ALGOLIA_INDEX"
                  [32m+[0m[0m value = "stocks"
                }
              [32m+[0m[0m env {
                  [32m+[0m[0m name = "OPENAI_API_KEY"

                  [32m+[0m[0m value_source {
                      [32m+[0m[0m secret_key_ref {
                          [32m+[0m[0m secret  = "OPENAI_API_KEY"
                          [32m+[0m[0m version = "latest"
                        }
                    }
                }

              [32m+[0m[0m liveness_probe {
                  [32m+[0m[0m failure_threshold     = 3
                  [32m+[0m[0m initial_delay_seconds = 30
                  [32m+[0m[0m period_seconds        = 30
                  [32m+[0m[0m timeout_seconds       = 5

                  [32m+[0m[0m http_get {
                      [32m+[0m[0m path = "/health"
                      [32m+[0m[0m port = 8080
                    }
                }

              [32m+[0m[0m ports {
                  [32m+[0m[0m container_port = 8080
                  [32m+[0m[0m name           = "http1"
                }

              [32m+[0m[0m resources {
                  [32m+[0m[0m cpu_idle          = false
                  [32m+[0m[0m limits            = {
                      [32m+[0m[0m "cpu"    = "2"
                      [32m+[0m[0m "memory" = "2Gi"
                    }
                  [32m+[0m[0m startup_cpu_boost = true
                }

              [32m+[0m[0m startup_probe {
                  [32m+[0m[0m failure_threshold     = 3
                  [32m+[0m[0m initial_delay_seconds = 5
                  [32m+[0m[0m period_seconds        = 10
                  [32m+[0m[0m timeout_seconds       = 3

                  [32m+[0m[0m http_get {
                      [32m+[0m[0m path = "/health"
                      [32m+[0m[0m port = 8080
                    }
                }
            }

          [32m+[0m[0m scaling {
              [32m+[0m[0m max_instance_count = 100
              [32m+[0m[0m min_instance_count = 1
            }
        }

      [32m+[0m[0m traffic {
          [32m+[0m[0m percent = 100
          [32m+[0m[0m type    = "TRAFFIC_TARGET_ALLOCATION_TYPE_LATEST"
        }
    }

[1m  # module.shorts_api.google_cloud_run_v2_service_iam_member.public_access[0m will be created
[0m  [32m+[0m[0m resource "google_cloud_run_v2_service_iam_member" "public_access" {
      [32m+[0m[0m etag     = (known after apply)
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m location = "australia-southeast2"
      [32m+[0m[0m member   = "allUsers"
      [32m+[0m[0m name     = "shorts"
      [32m+[0m[0m project  = "shorted-dev-aba5688f"
      [32m+[0m[0m role     = "roles/run.invoker"
    }

[1m  # module.shorts_api.google_pubsub_topic_iam_member.enrichment_jobs_publisher[0m will be created
[0m  [32m+[0m[0m resource "google_pubsub_topic_iam_member" "enrichment_jobs_publisher" {
      [32m+[0m[0m etag    = (known after apply)
      [32m+[0m[0m id      = (known after apply)
      [32m+[0m[0m member  = (known after apply)
      [32m+[0m[0m project = "shorted-dev-aba5688f"
      [32m+[0m[0m role    = "roles/pubsub.publisher"
      [32m+[0m[0m topic   = "enrichment-jobs"
    }

[1m  # module.shorts_api.google_secret_manager_secret_iam_member.algolia_app_id[0m will be created
[0m  [32m+[0m[0m resource "google_secret_manager_secret_iam_member" "algolia_app_id" {
      [32m+[0m[0m etag      = (known after apply)
      [32m+[0m[0m id        = (known after apply)
      [32m+[0m[0m member    = (known after apply)
      [32m+[0m[0m project   = "shorted-dev-aba5688f"
      [32m+[0m[0m role      = "roles/secretmanager.secretAccessor"
      [32m+[0m[0m secret_id = "ALGOLIA_APP_ID"
    }

[1m  # module.shorts_api.google_secret_manager_secret_iam_member.algolia_search_key[0m will be created
[0m  [32m+[0m[0m resource "google_secret_manager_secret_iam_member" "algolia_search_key" {
      [32m+[0m[0m etag      = (known after apply)
      [32m+[0m[0m id        = (known after apply)
      [32m+[0m[0m member    = (known after apply)
      [32m+[0m[0m project   = "shorted-dev-aba5688f"
      [32m+[0m[0m role      = "roles/secretmanager.secretAccessor"
      [32m+[0m[0m secret_id = "ALGOLIA_SEARCH_KEY"
    }

[1m  # module.shorts_api.google_secret_manager_secret_iam_member.openai_api_key[0m will be created
[0m  [32m+[0m[0m resource "google_secret_manager_secret_iam_member" "openai_api_key" {
      [32m+[0m[0m etag      = (known after apply)
      [32m+[0m[0m id        = (known after apply)
      [32m+[0m[0m member    = (known after apply)
      [32m+[0m[0m project   = "shorted-dev-aba5688f"
      [32m+[0m[0m role      = "roles/secretmanager.secretAccessor"
      [32m+[0m[0m secret_id = "OPENAI_API_KEY"
    }

[1m  # module.shorts_api.google_secret_manager_secret_iam_member.postgres_password[0m will be created
[0m  [32m+[0m[0m resource "google_secret_manager_secret_iam_member" "postgres_password" {
      [32m+[0m[0m etag      = (known after apply)
      [32m+[0m[0m id        = (known after apply)
      [32m+[0m[0m member    = (known after apply)
      [32m+[0m[0m project   = "shorted-dev-aba5688f"
      [32m+[0m[0m role      = "roles/secretmanager.secretAccessor"
      [32m+[0m[0m secret_id = "APP_STORE_POSTGRES_PASSWORD"
    }

[1m  # module.shorts_api.google_service_account.shorts_api[0m will be created
[0m  [32m+[0m[0m resource "google_service_account" "shorts_api" {
      [32m+[0m[0m account_id   = "shorts"
      [32m+[0m[0m description  = "Service account for the Shorts API"
      [32m+[0m[0m disabled     = false
      [32m+[0m[0m display_name = "Shorts API Service"
      [32m+[0m[0m email        = (known after apply)
      [32m+[0m[0m id           = (known after apply)
      [32m+[0m[0m member       = (known after apply)
      [32m+[0m[0m name         = (known after apply)
      [32m+[0m[0m project      = "shorted-dev-aba5688f"
      [32m+[0m[0m unique_id    = (known after apply)
    }

[1m  # module.stock_price_ingestion.google_cloud_run_v2_service.stock_price_ingestion[0m will be created
[0m  [32m+[0m[0m resource "google_cloud_run_v2_service" "stock_price_ingestion" {
      [32m+[0m[0m conditions              = (known after apply)
      [32m+[0m[0m create_time             = (known after apply)
      [32m+[0m[0m creator                 = (known after apply)
      [32m+[0m[0m delete_time             = (known after apply)
      [32m+[0m[0m effective_annotations   = (known after apply)
      [32m+[0m[0m effective_labels        = {
          [32m+[0m[0m "environment" = "production"
          [32m+[0m[0m "managed_by"  = "terraform"
          [32m+[0m[0m "service"     = "stock-price-ingestion"
        }
      [32m+[0m[0m etag                    = (known after apply)
      [32m+[0m[0m expire_time             = (known after apply)
      [32m+[0m[0m generation              = (known after apply)
      [32m+[0m[0m id                      = (known after apply)
      [32m+[0m[0m ingress                 = (known after apply)
      [32m+[0m[0m labels                  = {
          [32m+[0m[0m "environment" = "production"
          [32m+[0m[0m "managed_by"  = "terraform"
          [32m+[0m[0m "service"     = "stock-price-ingestion"
        }
      [32m+[0m[0m last_modifier           = (known after apply)
      [32m+[0m[0m latest_created_revision = (known after apply)
      [32m+[0m[0m latest_ready_revision   = (known after apply)
      [32m+[0m[0m launch_stage            = (known after apply)
      [32m+[0m[0m location                = "australia-southeast2"
      [32m+[0m[0m name                    = "stock-price-ingestion"
      [32m+[0m[0m observed_generation     = (known after apply)
      [32m+[0m[0m project                 = "shorted-dev-aba5688f"
      [32m+[0m[0m reconciling             = (known after apply)
      [32m+[0m[0m terminal_condition      = (known after apply)
      [32m+[0m[0m terraform_labels        = {
          [32m+[0m[0m "environment" = "production"
          [32m+[0m[0m "managed_by"  = "terraform"
          [32m+[0m[0m "service"     = "stock-price-ingestion"
        }
      [32m+[0m[0m traffic_statuses        = (known after apply)
      [32m+[0m[0m uid                     = (known after apply)
      [32m+[0m[0m update_time             = (known after apply)
      [32m+[0m[0m uri                     = (known after apply)

      [32m+[0m[0m template {
          [32m+[0m[0m max_instance_request_concurrency = (known after apply)
          [32m+[0m[0m service_account                  = (known after apply)
          [32m+[0m[0m timeout                          = "600s"

          [32m+[0m[0m containers {
              [32m+[0m[0m image = "australia-southeast2-docker.pkg.dev/shorted-dev-aba5688f/shorted/stock-price-ingestion:pr-44"

              [32m+[0m[0m env {
                  [32m+[0m[0m name  = "ENVIRONMENT"
                  [32m+[0m[0m value = "production"
                }
              [32m+[0m[0m env {
                  [32m+[0m[0m name  = "GCP_PROJECT"
                  [32m+[0m[0m value = "shorted-dev-aba5688f"
                }
              [32m+[0m[0m env {
                  [32m+[0m[0m name = "DATABASE_URL"

                  [32m+[0m[0m value_source {
                      [32m+[0m[0m secret_key_ref {
                          [32m+[0m[0m secret  = "DATABASE_URL"
                          [32m+[0m[0m version = "latest"
                        }
                    }
                }
              [32m+[0m[0m env {
                  [32m+[0m[0m name = "ALPHA_VANTAGE_API_KEY"

                  [32m+[0m[0m value_source {
                      [32m+[0m[0m secret_key_ref {
                          [32m+[0m[0m secret  = "ALPHA_VANTAGE_API_KEY"
                          [32m+[0m[0m version = "latest"
                        }
                    }
                }

              [32m+[0m[0m liveness_probe {
                  [32m+[0m[0m failure_threshold     = 3
                  [32m+[0m[0m initial_delay_seconds = 30
                  [32m+[0m[0m period_seconds        = 30
                  [32m+[0m[0m timeout_seconds       = 10

                  [32m+[0m[0m http_get {
                      [32m+[0m[0m path = "/health"
                      [32m+[0m[0m port = 8080
                    }
                }

              [32m+[0m[0m ports {
                  [32m+[0m[0m container_port = 8080
                  [32m+[0m[0m name           = "http1"
                }

              [32m+[0m[0m resources {
                  [32m+[0m[0m cpu_idle          = false
                  [32m+[0m[0m limits            = {
                      [32m+[0m[0m "cpu"    = "1"
                      [32m+[0m[0m "memory" = "1Gi"
                    }
                  [32m+[0m[0m startup_cpu_boost = true
                }

              [32m+[0m[0m startup_probe {
                  [32m+[0m[0m failure_threshold     = 3
                  [32m+[0m[0m initial_delay_seconds = 10
                  [32m+[0m[0m period_seconds        = 10
                  [32m+[0m[0m timeout_seconds       = 5

                  [32m+[0m[0m http_get {
                      [32m+[0m[0m path = "/health"
                      [32m+[0m[0m port = 8080
                    }
                }
            }

          [32m+[0m[0m scaling {
              [32m+[0m[0m max_instance_count = 10
              [32m+[0m[0m min_instance_count = 0
            }
        }

      [32m+[0m[0m traffic {
          [32m+[0m[0m percent = 100
          [32m+[0m[0m type    = "TRAFFIC_TARGET_ALLOCATION_TYPE_LATEST"
        }
    }

[1m  # module.stock_price_ingestion.google_cloud_run_v2_service_iam_member.invoker[0m will be created
[0m  [32m+[0m[0m resource "google_cloud_run_v2_service_iam_member" "invoker" {
      [32m+[0m[0m etag     = (known after apply)
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m location = "australia-southeast2"
      [32m+[0m[0m member   = "allUsers"
      [32m+[0m[0m name     = "stock-price-ingestion"
      [32m+[0m[0m project  = "shorted-dev-aba5688f"
      [32m+[0m[0m role     = "roles/run.invoker"
    }

[1m  # module.stock_price_ingestion.google_cloud_scheduler_job.daily_sync[0m will be created
[0m  [32m+[0m[0m resource "google_cloud_scheduler_job" "daily_sync" {
      [32m+[0m[0m attempt_deadline = "600s"
      [32m+[0m[0m description      = "Daily sync of ASX stock prices from Yahoo Finance (after market close)"
      [32m+[0m[0m id               = (known after apply)
      [32m+[0m[0m name             = "stock-price-daily-sync"
      [32m+[0m[0m paused           = (known after apply)
      [32m+[0m[0m project          = "shorted-dev-aba5688f"
      [32m+[0m[0m region           = "australia-southeast1"
      [32m+[0m[0m schedule         = "0 8 * * 1-5"
      [32m+[0m[0m state            = (known after apply)
      [32m+[0m[0m time_zone        = "UTC"

      [32m+[0m[0m http_target {
          [32m+[0m[0m body        = "e30="
          [32m+[0m[0m headers     = {
              [32m+[0m[0m "Content-Type" = "application/json"
            }
          [32m+[0m[0m http_method = "POST"
          [32m+[0m[0m uri         = (known after apply)

          [32m+[0m[0m oidc_token {
              [32m+[0m[0m service_account_email = (known after apply)
            }
        }

      [32m+[0m[0m retry_config {
          [32m+[0m[0m max_backoff_duration = "3600s"
          [32m+[0m[0m max_doublings        = (known after apply)
          [32m+[0m[0m max_retry_duration   = "3600s"
          [32m+[0m[0m min_backoff_duration = "5s"
          [32m+[0m[0m retry_count          = 3
        }
    }

[1m  # module.stock_price_ingestion.google_cloud_scheduler_job.weekly_backfill[0m will be created
[0m  [32m+[0m[0m resource "google_cloud_scheduler_job" "weekly_backfill" {
      [32m+[0m[0m attempt_deadline = "1800s"
      [32m+[0m[0m description      = "Weekly comprehensive sync of stock prices (7-day backfill)"
      [32m+[0m[0m id               = (known after apply)
      [32m+[0m[0m name             = "stock-price-weekly-sync"
      [32m+[0m[0m paused           = (known after apply)
      [32m+[0m[0m project          = "shorted-dev-aba5688f"
      [32m+[0m[0m region           = "australia-southeast1"
      [32m+[0m[0m schedule         = "0 10 * * 0"
      [32m+[0m[0m state            = (known after apply)
      [32m+[0m[0m time_zone        = "UTC"

      [32m+[0m[0m http_target {
          [32m+[0m[0m body        = "eyJkYXlzX2JhY2siOjcsIm1vZGUiOiJiYWNrZmlsbCJ9"
          [32m+[0m[0m headers     = {
              [32m+[0m[0m "Content-Type" = "application/json"
            }
          [32m+[0m[0m http_method = "POST"
          [32m+[0m[0m uri         = (known after apply)

          [32m+[0m[0m oidc_token {
              [32m+[0m[0m service_account_email = (known after apply)
            }
        }

      [32m+[0m[0m retry_config {
          [32m+[0m[0m max_backoff_duration = "7200s"
          [32m+[0m[0m max_doublings        = (known after apply)
          [32m+[0m[0m max_retry_duration   = "7200s"
          [32m+[0m[0m min_backoff_duration = "10s"
          [32m+[0m[0m retry_count          = 2
        }
    }

[1m  # module.stock_price_ingestion.google_secret_manager_secret_iam_member.alpha_vantage_api_key[0m will be created
[0m  [32m+[0m[0m resource "google_secret_manager_secret_iam_member" "alpha_vantage_api_key" {
      [32m+[0m[0m etag      = (known after apply)
      [32m+[0m[0m id        = (known after apply)
      [32m+[0m[0m member    = (known after apply)
      [32m+[0m[0m project   = "shorted-dev-aba5688f"
      [32m+[0m[0m role      = "roles/secretmanager.secretAccessor"
      [32m+[0m[0m secret_id = "ALPHA_VANTAGE_API_KEY"
    }

[1m  # module.stock_price_ingestion.google_secret_manager_secret_iam_member.database_url[0m will be created
[0m  [32m+[0m[0m resource "google_secret_manager_secret_iam_member" "database_url" {
      [32m+[0m[0m etag      = (known after apply)
      [32m+[0m[0m id        = (known after apply)
      [32m+[0m[0m member    = (known after apply)
      [32m+[0m[0m project   = "shorted-dev-aba5688f"
      [32m+[0m[0m role      = "roles/secretmanager.secretAccessor"
      [32m+[0m[0m secret_id = "DATABASE_URL"
    }

[1m  # module.stock_price_ingestion.google_service_account.stock_price_ingestion[0m will be created
[0m  [32m+[0m[0m resource "google_service_account" "stock_price_ingestion" {
      [32m+[0m[0m account_id   = "stock-price-ingestion"
      [32m+[0m[0m description  = "Service account for stock price data ingestion from Alpha Vantage and Yahoo Finance"
      [32m+[0m[0m disabled     = false
      [32m+[0m[0m display_name = "Stock Price Ingestion Service"
      [32m+[0m[0m email        = (known after apply)
      [32m+[0m[0m id           = (known after apply)
      [32m+[0m[0m member       = (known after apply)
      [32m+[0m[0m name         = (known after apply)
      [32m+[0m[0m project      = "shorted-dev-aba5688f"
      [32m+[0m[0m unique_id    = (known after apply)
    }

[1mPlan:[0m 55 to add, 0 to change, 0 to destroy.
[0m
Changes to Outputs:
  [32m+[0m[0m artifact_registry_repository          = "australia-southeast2-docker.pkg.dev/shorted-dev-aba5688f/shorted"
  [32m+[0m[0m cms_service_account                   = (known after apply)
  [32m+[0m[0m cms_url                               = (known after apply)
  [32m+[0m[0m short_data_sync_bucket                = "shorted-short-selling-data"
  [32m+[0m[0m short_data_sync_job_name              = "shorts-data-sync"
  [32m+[0m[0m short_data_sync_scheduler_job         = "shorts-data-sync-daily"
  [32m+[0m[0m shorts_api_service_account            = (known after apply)
  [32m+[0m[0m shorts_api_url                        = (known after apply)
  [32m+[0m[0m stock_price_daily_sync_job            = "stock-price-daily-sync"
  [32m+[0m[0m stock_price_ingestion_service_account = (known after apply)
  [32m+[0m[0m stock_price_ingestion_url             = (known after apply)
  [32m+[0m[0m stock_price_weekly_backfill_job       = "stock-price-weekly-sync"
[90m
─────────────────────────────────────────────────────────────────────────────[0m

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```

</details>

*Environment: dev*
*Project: shorted-dev-aba5688f*
*Image Tag: pr-44*
